иб/src/DataProcessors/_ts56_ru_Генерация_QR_Кода/_ts56_ru_Генерация_QR_Кода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>_ts56_ru_Генерация_QR_Кода</name>
  <attributes>
    <name>_Погрешность_Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Размер_Пикселей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>_Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>_Файл_Имя_Полное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

иб/src/DataProcessors/_ts56_ru_Генерация_QR_Кода/Forms/Форма/Module.bsl
&НаСервере
Функция мСформировать_Сервер()
	лТекст = СокрЛП( Объект._Текст );
	Если лТекст = "" Тогда
		Сообщить( "Текст пустой." );
		Возврат Ложь;
	КонецЕсли;
	
	лЭтот_Объект = РеквизитФормыВЗначение( "Объект" );
	
	лДанные = лЭтот_Объект._QR_Код_Получить( лТекст, Объект._Погрешность_Уровень, Объект._Размер_Пикселей, Объект._Файл_Имя_Полное );
	Если ТипЗнч( лДанные ) <> Тип( "ДвоичныеДанные" ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтаФорма._Изображение = ПоместитьВоВременноеХранилище( лДанные );
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура мСформировать(Команда)
	мСформировать_Сервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект._Размер_Пикселей = 0 Тогда
		Объект._Размер_Пикселей = 1000;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура мФайл_Имя_Полное_Начало_Выбора( пЭлемент, пДанные_Выбора, пСтандартная_Обработка )
	пСтандартная_Обработка = Ложь;
	лДиалог = Новый ДиалогВыбораФайла( РежимДиалогаВыбораФайла.Сохранение );
	лДиалог.ПолноеИмяФайла = Объект._Файл_Имя_Полное;
	лДиалог.Фильтр = "PNG (*.png)|*.png";

	Если лДиалог.Выбрать() Тогда
		Объект._Файл_Имя_Полное = лДиалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры
